package org.example.Seminar4.HW4;

public class task1 {
    /*
1.Использование тестовых заглушек в модульных тестах: При написании модульных тестов тестовые заглушки могут быть полезны
для изоляции модуля от зависимостей, обеспечивая контролируемые условия тестирования.

2.Тип заглушки для проверки вызова с аргументами: Для проверки вызова метода с определенными аргументами следует
использовать заглушки с утверждениями (assertion stubs).

3.Тип заглушки для возвращения значения или исключения: Для простого возвращения значения или исключения следует
использовать заглушки с возвратом (return stubs).

4.Тип заглушки для имитации взаимодействия с внешним API или базой данных: Для имитации взаимодействия с внешним
API или базой данных рекомендуется использовать заглушки для взаимодействия (interaction stubs), которые обеспечивают
контролируемое взаимодействие и избегают фактических вызовов к внешним ресурсам во время тестирования.
     */
}
